src/Documents/Чеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Чеки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итого</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безналичные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ОбщийМодуль2/Ext/Module.bsl
&НаСервере
Функция Получить() Экспорт // тут я получаю случайное первое сообщение из первого обсуждения 
	ОтборОбсуждений = Новый ОтборОбсужденийСистемыВзаимодействия();
	Обсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(ОтборОбсуждений);
	ОтборСообщений = Новый ОтборСообщенийСистемыВзаимодействия();  
	ПоследнееСообщениеИд = Новый ИдентификаторСообщенияСистемыВзаимодействия(Константы.ИдентификаторПоследнего.Получить());
	ОтборСообщений.После = ПоследнееСообщениеИд;     
	ПоследнееСообщение = СистемаВзаимодействия.ПолучитьСообщение(ПоследнееСообщениеИд);
	Обсуждение = Обсуждения[0];
	ОтборСообщений.Обсуждение = Обсуждение.Идентификатор;   
	Сообщения = СистемаВзаимодействия.ПолучитьСообщения(ОтборСообщений); 
	
	//идентфикатор записывать в переменную
	
	
	Для каждого Сообщение из Сообщения Цикл
		Попытка    
			

		ПоследнееСообщение =Сообщение.Идентификатор;
		 
		 
		СтрокиЧека = СтрРазделить(Сообщение.Текст, Символы.ПС, Ложь);
	 		 
		 // Парсинг касающийся даты
		 
		СтрокаДаты = СтрРазделить(СтрокиЧека[1], ":")[1] + " " + СтрРазделить(СтрокиЧека[1], ":")[2]; 
		ИтоговаяДата = РаспарситьДату(СтрокаДаты); 
		 		     
		//
		
		Отправитель = СтрРазделить(СтрокиЧека[0], ":")[1];
		Отправитель = СтрРазделить(СокрЛП(Отправитель), " "); 
		Отправитель.Удалить(0);
		Отправитель = СтрСоединить(Отправитель, " ");
		
		ИНН = СтрРазделить(СтрокиЧека[2], ":");   
		
		
		СписокТоваров = Новый Массив();
		Счетчик = 3;
		Пока СтрРазделить(СтрокиЧека[Счетчик], ":")[0] <> "Итого" Цикл
			Если Счетчик % 2 = 1 Тогда
				НовыйТовар = Новый Структура();
				НовыйТовар.Вставить("Наименование", СтрРазделить(СтрокиЧека[Счетчик], " ")[1]);
				
				//Сообщить("Это строка с товаром" + СтрокиЧека[Счетчик]);
			Иначе
				//Сообщить("Это строка с суммой" + СтрокиЧека[Счетчик]);   
				
				СтрокаСуммы = СтрРазделить(СтрокиЧека[Счетчик], " ");
				НовыйТовар.Вставить("Цена", СтрокаСуммы[0]);
				НовыйТовар.Вставить("Количество", СтрокаСуммы[2]);
				НовыйТовар.Вставить("Сумма", СтрокаСуммы[4]);
				СписокТоваров.Добавить(НовыйТовар)
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла; 
		
		
		
		
		Итого = СтрРазделить(СтрокиЧека[Счетчик], ":");
		Наличные = СтрРазделить(СтрокиЧека[Счетчик + 1], ": ", Ложь)[1];
		Безналичные = СтрРазделить(СтрокиЧека[Счетчик + 2], ": ", Ложь)[1];
		Если СтрРазделить(СтрокиЧека[Счетчик + 3], ":", Ложь)[0] = "НДС итога чека со ставкой 10%" Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		НомерСмены = СтрРазделить(СтрокиЧека[Счетчик + 3], ": ", Ложь)[2];  
		Кассир = "";
		Если СтрРазделить(СтрокиЧека[Счетчик +4], ":")[0] = "Кассир" Тогда
			Кассир = СтрРазделить(СтрокиЧека[Счетчик +4], ":")[1];
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		МестоРасчётов = СтрРазделить(СтрокиЧека[Счетчик +4], ":");
		АдресРасчётов = СтрРазделить(СтрокиЧека[Счетчик + 5], ":");
		НомерЧека = СтрРазделить(СтрокиЧека[Счетчик + 6], ": ", Ложь)[2];
		СНО = СтрРазделить(СтрокиЧека[Счетчик + 7], ":");
		РНККТ = СтрРазделить(СтрокиЧека[Счетчик + 8], ":");
		ФН = СтрРазделить(СтрокиЧека[Счетчик + 9], ":");
		ФД = СтрРазделить(СтрокиЧека[Счетчик + 10], ":");
		ФП = СтрРазделить(СтрокиЧека[Счетчик + 11], ":");  
		 
		 //
		 
		НовыйЧек = Документы.Чеки.СоздатьДокумент();
				
		НовыйЧек.Дата = ИтоговаяДата; 
		НовыйЧек.Итого = Итого[1];
		НовыйЧек.Наличные = Число(СокрЛП(Наличные));
		НовыйЧек.Безналичные = Число(СокрЛП(Безналичные));
		НовыйЧек.НомерСмены = Число(СокрЛп(НомерСмены)); 
		НовыйЧек.Кассир = Кассир;
		НовыйЧек.МестоРасчетов = МестоРасчётов[1];
		НовыйЧек.АдресРасчетов = АдресРасчётов[1];
		НовыйЧек.НомерЧека = Число(СокрЛП(НомерЧека));
		НовыйЧек.СНО = СНО[1];
		НовыйЧек.РНККТ = РНККТ[1];
		НовыйЧек.ФН = ФН[1];
		НовыйЧек.ФД = ФД[1];
		НовыйЧек.ФП = ФП[1];
		 
		 
		
		 
		 //  
		Статус = Справочники.Контрагенты.НайтиПоНаименованию(Отправитель); // добавление контрагента, если ранее такого не было
		Если Статус = Справочники.Контрагенты.ПустаяСсылка() Тогда
			НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
			НовыйКонтрагент.Наименование = Отправитель;
			НовыйКонтрагент.ИНН = Число(ИНН[1]);
			НовыйКонтрагент.Записать();
			НовыйЧек.Контрагент = НовыйКонтрагент.Ссылка;
		Иначе
			НовыйЧек.Контрагент = Статус;
		КонецЕсли;	
		
		Для Каждого Товар из СписокТоваров Цикл
			ТоварВТаблице = НовыйЧек.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТоварВТаблице, Товар);
			
		КонецЦикла;
		
				
		НовыйЧек.Записать();
		
			
		Исключение
			 Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Константы.ИдентификаторПоследнего.Установить(Сообщение.Идентификатор);
		 
	КонецЦикла;
	Возврат "";
	// Возврат Сообщения[0].Текст;
КонецФункции   

Функция РаспарситьДату(СтрокаДаты) // парсить строку вида день.месяц.год часы:минуты в дату
		СтрокаДаты = СокрЛП(СтрокаДаты);
		СтрокаДаты = СтрЗаменить(СтрокаДаты, ".", " ");
		СтрокаДаты = СтрЗаменить(СтрокаДаты, ":", " "); 
		МассивСтрок = СтрРазделить(СтрокаДаты, " ");
		  
		Год = Число(МассивСтрок[2]);
		Месяц = Число(МассивСтрок[1]);
		День = Число(МассивСтрок[0]);
		Час = Число(МассивСтрок[3]);
		Минута = Число(МассивСтрок[4]);
		
		ИтоговаяДата = Дата(Год, Месяц, День, Час, Минута, 0);
		
		Возврат ИтоговаяДата;

КонецФункции
